//문제1
//아래와 같은 실행결과가 나오도록 프로그램을 작성하시오.
//int score[][] = {
					/*{ 88,95,100 },
					{ 85,63,20 },
					{ 34,30,30 },
					{ 40,49,70 },
					{ 15,75,98 },*/
//}
//위와 같이 score 2차원 배열을 선언과 동시에 초기화를 한다.
//실행결과
//번호 국어 영어 수학 총점 평균
//============================================
//1		88	95	100		283	94.3
//2		85	63	20		168	56.0
//3		34	30	30		94	31.3
//4		40	49	70		159	53.0
//5		15	75	98		188	62.7
//============================================
//총점 ->[국어]262[영어]312[수학]318
//------------------------------------------------------------------------------------

//#include <stdio.h>
//#define ROW 5
//#define COLUMN 3
//
//int main(void)
//{
//	int i = 0, j = 0, cnt = 1, total = 0;
//	float avg = 0.0f;
//	int score[ROW][COLUMN] = {  {88,95,100},
//								{85,63,20},
//								{34,30,30},
//								{40,49,70},
//								{15,75,98}
//							 };
//	int temp[COLUMN] = { 0 };
//
//	printf("번호   국어 영어 수학 총점 평균\n");
//	printf("===================================\n");
//
//	for (i = 0; i < ROW; i++)
//	{
//		printf("%d\t", cnt++);
//		for (j = 0; j < COLUMN; j++)
//		{
//			total += score[i][j];
//			printf("%3d  ", score[i][j]);
//		}
//		avg = (float)total / COLUMN;
//		printf("%3d  %.1f\n", total, avg);
//		total = 0;
//	}
//	printf("===================================\n");
//
//	for (i = 0; i < COLUMN; i++)
//	{
//		for (j = 0; j < ROW; j++)
//		{
//			total += score[j][i];
//		}
//		temp[i] = total;
//		total = 0;
//	}
//	printf("총점 ->[국어] : %d [영어] : %d [수학] : %d\n", temp[0], temp[1], temp[2]);
//
//
//	return 0;
//}
