//문제3
//아래와 같이 정수형 2차원 배열이 초기화가 되어 있다. 배열 포인터와 포인터 배열을 이용해서
//실행결과와 동일하게 나오도록 프로그램을 작성하시오.
//int arr[4][4] = {{10,22,34,45},{54,66,75,86},{74,100,105,109},{94,150,187,195}};와 같이
//2차원 배열이 선언되고 초기화 되도록 한다. 이것을 배열 포인터에 대입하도록 하자.

//함수의 원형(선언부)
//void showArrayValue(int (*myArr)[4]);
//void showCopyArrayValue(int (*myArr)[4]);

//실행결과
//===========================
//arr현재값 출력
//===========================
//10  22  34  45
//54  66  75  86
//74 100 105 109
//94 150 187 195
//===========================
//===========================
//copyArray배열로 복사된 값 출력
//===========================
//10  22  34  45
//54  66  75  86
//74 100 105 109
//94 150 187 195
//===========================
//배열의 값을 얼마씩 증가시킬까요 ? : -11
//===========================
//-1  11  23  34
//43  55  64  75
//63  89  94  98
//83 139 176 184
//===========================
//-----------------------------------------------------

//#include <stdio.h>
//#define ROW 4
//#define COL 4
//
//void showArrayValue(int(*myArr)[4]);
//void showCopyArrayValue(int(*myArr)[4]);
//
//int main(void)
//{
//	int arr[ROW][COL] = {
//							{10,22,34,45},
//							{54,66,75,86},
//							{74,100,105,109},
//							{94,150,187,195}
//						};
//	int(*parry)[ROW] = { NULL };
//	int n = 0;
//
//	parry = arr;
//
//	showArrayValue(parry);
//	showCopyArrayValue(parry);
//
//	printf("배열의 값을 얼마씩 증가시킬까요 ? : ");
//	scanf_s("%d", &n);
//
//	printf("====================================\n");
//	for (int i = 0; i < ROW; i++)
//	{
//		for (int j = 0; j < COL; j++)
//		{
//			parry[i][j] = parry[i][j] + n;
//			printf("%3d  ", parry[i][j]);
//		}
//		printf("\n");
//	}
//
//	printf("====================================\n");
//
//	return 0;
//}
//
//void showArrayValue(int(*myArr)[ROW])
//{
//	printf("====================================\n");
//	printf("arr현재값 출력\n");
//	printf("====================================\n");
//	for (int i = 0; i < ROW; i++)
//	{
//		for (int j = 0; j < COL; j++)
//		{
//			printf("%3d  ", myArr[i][j]);
//		}
//		printf("\n");
//	}
//	printf("====================================\n");
//
//	return;
//}
//
//void showCopyArrayValue(int(*myArr)[ROW])
//{
//	int copyArray[ROW][COL] = { 0 };
//	printf("====================================\n");
//	printf("copyArray배열로 복사된 값 출력\n");
//	printf("====================================\n");
//	for (int i = 0; i < ROW; i++)
//	{
//		for (int j = 0; j < COL; j++)
//		{
//			copyArray[i][j] = myArr[i][j];
//		}
//	}
//
//	for (int i = 0; i < ROW; i++)
//	{
//		for (int j = 0; j < COL; j++)
//		{
//			printf("%3d  ", copyArray[i][j]);
//		}
//		printf("\n");
//	}
//	printf("====================================\n");
//
//	return;
//}